In [1]:
import numpy as np
import pandas as pd

In [2]:
d={"A": [1,2, np.nan], "B": [5, np.nan, np.nan], "C": [1,2,3]}

In [3]:
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [4]:
df=pd.DataFrame(d)

In [7]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [8]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [9]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [10]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [11]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [12]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [13]:
df.fillna(value="fill")

      A     B  C
0     1     5  1
1     2  fill  2
2  fill  fill  3

In [16]:
df["A"].mean()

1.5

In [15]:
df["A"].fillna(value=df["A"].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [ ]:
# df = df.fillna(value = 0)
# df = df.fillna(method = "pad") #filling the values with previous value
# df = df.fillna(method = "bfill") #filling the values with next value-backward fill
# df = df.fillna(method = "pad", axis = 1) #filling the values with previous value in column
# df = df.fillna(method = "bfill", axis = 1) #filling the values with next value-backward fill in column
# df = df.fillna({"dispositif": "BC", "site": "Vire"}) #fill the value with custom manner
# df = df.fillna(value = df["jour"].mean()) # fill the value with the mean, max, min
# df = df.dropna(how = "any") #drops any row has null value
# df = df.dropna(how = "all") #if every cell null then deletes
# df = df.replace(to_replace=np.nan, value = 123) # beauty of it you can replace not only null value but also every values
# df["jour"] = df["jour"].interpolate(method = "linear") #numeric column ortalamasını atar

### How do I handle missing values in pandas?

Data School

In [3]:
ufo = pd.read_csv("http://bit.ly/uforeports")

In [4]:
ufo.tail()

              City Colors Reported Shape Reported State              Time
18236   Grant Park             NaN       TRIANGLE    IL  12/31/2000 23:00
18237  Spirit Lake             NaN           DISK    IA  12/31/2000 23:00
18238  Eagle River             NaN            NaN    WI  12/31/2000 23:45
18239  Eagle River             RED          LIGHT    WI  12/31/2000 23:45
18240         Ybor             NaN           OVAL    FL  12/31/2000 23:59

**NaN: Not a number**, basically means missing value.

### Methods to cope with

### isnull() DataFrame Method

In [6]:
ufo.isnull().tail()

        City  Colors Reported  Shape Reported  State   Time
18236  False             True           False  False  False
18237  False             True           False  False  False
18238  False             True            True  False  False
18239  False            False           False  False  False
18240  False             True           False  False  False

In [7]:
ufo.notnull().tail()

       City  Colors Reported  Shape Reported  State  Time
18236  True            False            True   True  True
18237  True            False            True   True  True
18238  True            False           False   True  True
18239  True             True            True   True  True
18240  True            False            True   True  True

In [8]:
ufo.isnull().sum()

City                  25
Colors Reported    15359
Shape Reported      2644
State                  0
Time                   0
dtype: int64

#### How sum() works?

In [11]:
pd.Series([True, False, True])

0     True
1    False
2     True
dtype: bool

In [12]:
pd.Series([True, False, True]).sum()#pandas turnes out trues to 1, there 2 trues then sums it to 2.

2

**It shows up number of Trues.**

In [17]:
ufo[ufo.City.isnull()]

      City Colors Reported Shape Reported State              Time
21     NaN             NaN            NaN    LA    8/15/1943 0:00
22     NaN             NaN          LIGHT    LA    8/15/1943 0:00
204    NaN             NaN           DISK    CA   7/15/1952 12:30
241    NaN            BLUE           DISK    MT    7/4/1953 14:00
613    NaN             NaN           DISK    NV    7/1/1960 12:00
1877   NaN          YELLOW         CIRCLE    AZ    8/15/1969 1:00
2013   NaN             NaN            NaN    NH     8/1/1970 9:30
2546   NaN             NaN       FIREBALL    OH  10/25/1973 23:30
3123   NaN             RED       TRIANGLE    WV  11/25/1975 23:00
4736   NaN             NaN         SPHERE    CA   6/23/1982 23:00
5269   NaN             NaN            NaN    AZ   6/30/1985 21:30
6735   NaN             NaN      FORMATION    TX     4/1/1992 2:00
7208   NaN             NaN         CIRCLE    MI   10/4/1993 17:30
8828   NaN             NaN       TRIANGLE    WA  10/30/1995 21:30
8967   NaN             NaN        VARIOUS    CA   12/8/1995 18:00
9273   NaN             NaN       TRIANGLE    OH     5/1/1996 3:00
9388   NaN             NaN           OVAL    CA   6/12/1996 12:00
9587   NaN             NaN            EGG    FL   8/24/1996 15:00
10399  NaN             NaN       TRIANGLE    IL   6/15/1997 23:00
11625  NaN             NaN         CIRCLE    TX     6/7/1998 7:00
12441  NaN             RED       FIREBALL    WA  10/26/1998 17:58
15767  NaN             NaN      RECTANGLE    NV   1/21/2000 11:30
15812  NaN             NaN          LIGHT    NV     2/2/2000 3:00
16054  NaN           GREEN            NaN    FL    3/11/2000 3:30
16608  NaN             NaN         SPHERE    NY   6/15/2000 15:00

### DataFrame Method dropna()

In [18]:
ufo.shape

(18241, 5)

In [20]:
ufo.dropna(how = "any").shape# any'de herhangi bir sütun boşsa satırın tamamını atar.

(2486, 5)

In [21]:
ufo.dropna(how = "all").shape

(18241, 5)

In [22]:
ufo.dropna(subset = ["City", "Shape Reported"], how = "any").shape

(15576, 5)

In [25]:
ufo["Shape Reported"].value_counts(dropna = False)

LIGHT        2803
NaN          2644
DISK         2122
TRIANGLE     1889
OTHER        1402
CIRCLE       1365
SPHERE       1054
FIREBALL     1039
OVAL          845
CIGAR         617
FORMATION     434
VARIOUS       333
RECTANGLE     303
CYLINDER      294
CHEVRON       248
DIAMOND       234
EGG           197
FLASH         188
TEARDROP      119
CONE           60
CROSS          36
DELTA           7
CRESCENT        2
ROUND           2
FLARE           1
DOME            1
PYRAMID         1
HEXAGON         1
Name: Shape Reported, dtype: int64

### DataFrame fillna() method

We decided to fill these values as "Various". It depends on understanding the data.

In [26]:
ufo["Shape Reported"].fillna(value="VARIOUS", inplace=True)

In [27]:
ufo["Shape Reported"].value_counts(dropna = False)

VARIOUS      2977
LIGHT        2803
DISK         2122
TRIANGLE     1889
OTHER        1402
CIRCLE       1365
SPHERE       1054
FIREBALL     1039
OVAL          845
CIGAR         617
FORMATION     434
RECTANGLE     303
CYLINDER      294
CHEVRON       248
DIAMOND       234
EGG           197
FLASH         188
TEARDROP      119
CONE           60
CROSS          36
DELTA           7
CRESCENT        2
ROUND           2
FLARE           1
DOME            1
PYRAMID         1
HEXAGON         1
Name: Shape Reported, dtype: int64

### Spotting the missing value

In [29]:
data = {'nums': [1,2,3,4,5,np.nan,6,7,np.nan,8,9,10,np.nan]}
df = pd.DataFrame(data)
df

    nums
0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    NaN
6    6.0
7    7.0
8    NaN
9    8.0
10   9.0
11  10.0
12   NaN

Checking for NaN under a single DataFrame column

In [30]:
df['nums'].isnull().values.any()

True

Actual breakdown of the instances where NaN values exist

In [31]:
df['nums'].isnull()

0     False
1     False
2     False
3     False
4     False
5      True
6     False
7     False
8      True
9     False
10    False
11    False
12     True
Name: nums, dtype: bool

Get the nan values with the dataframe object

In [37]:
df.loc[df.nums.isnull()==True]

    nums
5    NaN
8    NaN
12   NaN

### Filling the mising values with most frequent categorical value

In [14]:
data = {"fruit": ["apple", "banana", np.nan, "banana"], "color": ["blue",np.nan, "green", "blue"]}
data

{'fruit': ['apple', 'banana', nan, 'banana'],
 'color': ['blue', nan, 'green', 'blue']}

In [15]:
df = pd.DataFrame(data)
df

    fruit  color
0   apple   blue
1  banana    NaN
2     NaN  green
3  banana   blue

In [19]:
df.isnull()

   fruit  color
0  False  False
1  False   True
2   True  False
3  False  False

In [22]:
df.fruit.value_counts()

banana    2
apple     1
Name: fruit, dtype: int64

In [25]:
df.fruit.value_counts().index[0]

'banana'

In [20]:
df.fruit.fillna(df.fruit.value_counts().index[0])

0     apple
1    banana
2    banana
3    banana
Name: fruit, dtype: object